quick_search_by_name_text = ("Для быстрого поиска по наименованию товара Вам необходимо ввести наименование товара или "
                             "его часть в строку поиска. Под поисковой строкой появится блок с результатами быстрого "
                             "поиска. Найдите название нужного Вам товара и нажмите на ссылку.")

search_by_name_text = ('Для поиска по наименованию товара Вам необходимо ввести наименование товара или его часть в '
                       'строку поиска и нажать кнопку "Поиск" или перейти по ссылке "все результаты" в появившихся '
                       'результатах быстрого поиска. В результатах расширенного поиска Вы найдете нужный товар.')

quick_search_by_vendor_text = ('Для быстрого поиска по артикулу товара Вам необходимо ввести артикул товара в строку '
                               'поиска. Под поисковой строкой появится блок с результатами быстрого поиска. Найдите '
                               'название нужного Вам товара и нажмите на ссылку')

search_by_vendor_text = ('Для поиска по артикулу товара Вам необходимо ввести артикул товара в строку поиска и нажать '
                         'кнопку "Поиск" или перейти по ссылке "все результаты" в появившихся результатах быстрого '
                         'поиска. В результатах расширенного поиска Вы найдете нужный товар')

search_by_author_text = ('Для поиска по автору книги Вам необходимо перейти по ссылке "Расширенный поиск" в разделе '
                         '"Навигация" в нижней части сайта. Ввести автора книги в поле "Автор" и нажать кнопку '
                         '"Найти". В результатах расширенного поиска Вы найдете нужный товар')

search_by_isbn_text = ('Для поиска по ISBN книги Вам необходимо перейти по ссылке "Расширенный поиск" в разделе '
                       '"Навигация" в нижней части сайта. Ввести ISBN книги или его часть в поле "ISBN" и нажать '
                       'кнопку "Найти". В результатах расширенного поиска Вы найдете нужный товар')

grafik_raboty_text = ('<b>Время работы:</b>\n\nПН-ПТ 9:00-19:00\n\n<b>>СБ, ВС - Выходные дни</b>\n\n<b>Перед тем, как к '
                      'нам ехать, обязательно узнайте о наличии товара в пункте самовывоза по телефонам, '
                      'указанным ниже.</b>\n\n+7 495 374 67 62\n+7 800 707 21 74\ninfo@centrmag.ru\nфакс: +7 499 713 '
                      '52 39'
                      '\n\n<b>Розничный магазин:</b> 125464, Россия, Москва, Пятницкое шоссе, д. 7, к. 1')

from_metro_text = ('Выход м."Волоколамская" (первый вагон из центра). <a '
                   'href="https://www.centrmag.ru/pict/vid1_vesna.jpg">(Посмотреть вид)</a>\n\nПо подземному переходу '
                   'перейти'
                   'на другую сторону дороги.\n\nОбогнуть дом по Новотушинскому проезду дом 6 корп. 1 справа, '
                   'войти во двор <a href="https://www.centrmag.ru/pict/vid2_vesna.jpg">(Посмотреть '
                   'вид)</a>.\n\nПройти мимо последнего подъезда дома №7 и повернуть налево ('
                   'Посмотреть вид).\n\nОбойти здание ЦТП с правой стороны <a '
                   'href="https://www.centrmag.ru/pict/vid3_vesna.jpg">(Посмотреть вид)</a> <a '
                   'href="https://www.centrmag.ru/pict/vid5_vesna.jpg">(Посмотреть вид)</a>.\n\nПройти'
                   'прямо по тропинке <a href="https://www.centrmag.ru/pict/vid6_vesna.jpg">(Посмотреть '
                   'вид)</a>\n\nПройти крыльцо магазина продукты <a '
                   'href="https://www.centrmag.ru/pict/vid7_vesna.jpg">(Посмотреть вид)</a>\n\nВход к нам'
                   'расположен рядом с магазином продукты (спуск в подвальное помещение напротив 4-го подъезда жилого '
                   'дома). <a href="https://www.centrmag.ru/pict/vid8_vesna.jpg">(Посмотреть вид)</a>')

from_mcd_text = ('Пройдите по дороге до первого входа в метро\n\nДалее пройти дальше по парку до следующего входа в '
                 'метро\n\nДалее аналогичный путь от метро "Волоколамская"')

by_bus_text = ('Станция м. Тушинская (последний вагон из центра).\n\nАвтобусы 400Т, 614, 2, 930, 210. Остановка "1-й '
               'микрорайон Митино".\n\nПерейти на другую сторону Пятницкого шоссе.\n\nНаш магазин находится в '
               'подвальном помещении нежилого здания во дворе жилого дома Пятницкое шоссе д. 7.')

delivery_methods_text = """
<b>Способы доставки:</b>

1. Самовывоз
2. ПВЗ и Постаматы
3. ПВЗ Яндекса
4. Курьерская доставка по Москве
5. Бесконтактная курьерская доставка по Москве
6. Пункты самовывоза по России
7. Курьерская доставка по всей России
8. Пункты выдачи и возможность курьерской доставки в Вашем городе
9. Отправка товара по почте

Выберите интересующий вас способ из списка ниже, чтобы узнать о нем подробнее или узнайте о них на сайте: 
https://www.centrmag.ru/information_pages/dostavka/"""

delivery_methods_list = ['Самовывоз', 'ПВЗ и Постаматы', 'Курьерская доставка по Москве', 'Бесконтактная курьерская '
                                                                                          'доставка по Москве',
                         'Пункты самовывоза по России', 'Курьерская доставка по всей России', 'Отправка товара по '
                                                                                              'почте']

samovivoz_text = """Самовывоз

Вы можете получить необходимые Вам товары по адресу:
г. Москва, Пятницкое шоссе, д 7 корп. 1 (подробнее).

Товар, который вы заказали, откладывается на ваше имя на срок до 7 дней. По истечении срока бронь снимается, 
заказ расформировывается.

Перед выездом в пункт самовывоза рекомендуем уточнить наличие товара по тел. +7 495 374 67 62.
Мы доставляем в пункт самовывоза бесплатно от любой суммы заказа."""

pvz_text = """ПВЗ и Постаматы

Мы доставляем заказы в Пункты выдачи заказов и в Постаматы.

Сумма корзины должна быть не менее 500 рублей

Ограничения по весу и габаритам представлены в таблице"""


kurierskaya_text = """<b>Курьерская доставка по Москве</b>

Мы доставляем товары по Москве через курьерскую службу доставки. Сумма корзины должна быть не менее 500 рублей

Доставка осуществляется в течение 1-2 рабочих дней после передачи заказа в курьерскую службу. Возможна доставка в 
выходные дни.

Оплата за заказ и доставку осуществляется курьеру, который вручит вам все финансовые документы.

Время доставки - с 9.00 до 19.00 ежедневно. Заказы доставляются после предварительного звонка. Представитель 
курьерской службы свяжется с Вами по контактному телефону для согласования даты и времени доставки. Если Вам удобна 
доставка в выходной день, или в рабочий день после 18.00 (до 21.00), сообщите об этом оператору курьерской службы во 
время предварительного звонка. Мы постараемся организовать доставку в удобное для Вас время.

Стоимость доставки заказов (в пределах МКАД): 300 рублей весом до 2 кг, до 4 кг. - 400 руб., свыше 4 кг. - 500 руб.

Вы вправе отказаться от доставленного Вам заказа без объяснения причины при условии, что услуги доставки будут оплачены.

У нас практикуется доставка курьером в города Подмосковья. Стоимость доставки курьером в города Подмосковья зависит 
от удаленности района.

Курьерская доставка в отдельные районы, расположенные за МКАД: например, Куркино - всего 300 рублей"""


beskontaktnaya_kurierskaya_text = """
Бесконтактная курьерская доставка по Москве

На время карантина наш интернет-магазин осуществляет бесконтактную доставку заказов если:

    ◾️ <b>заказ оплачен</b>, то курьер оставляет его в заранее оговоренном месте. Вы забираете заказ, проверяете его 
    комплектацию и, если это необходимо, кладете документы на место, где забрали заказ.
    
    ◾️ <b>заказ не оплачен</b>, процедура получения заказа такая же, но, оплату необходимо произвести на карту 
    Сбербанка, номер которой будет приложен к заказу. Курьер будет ждать проверки заказа и, после того, 
    как он убедится, что заказ получен, он уезжает. В соответствии с рекомендациями ВОЗ, курьер произведет 
    дезинфекцию заказа.

Сумма заказа должна быть не менее 500 рублей"""


punkti_samovivoza_text = """<b>Пункты самовывоза по России</b>

Вы можете получить заказ в пунктах самовывоза наших партнеров по всей России. Для этого при оформлении заказа 
выберите способ доставки "Пункты самовывоза".

Сумма корзины должна быть не менее 500 рублей

Отправка оплаченного товара в пункты самовывоза осуществляется в течение 1-2 рабочих дней после получения 
<b>полной</b> или <b>частичной предоплаты</b>. Для заказов на товары до 2 000 р. Требуется <b>ПОЛНАЯ</b> предоплата.

<b>Срок доставки товара от 03 до 10 рабочих дней (в зависимости от Вашего региона)</b>"""


kurierskaya_po_vsei_rossii_text = """<b>Курьерская доставка по всей России</b>

Мы передадим заказ в курьерскую службу и она доставит его Вам до двери по всей России.

Сумма корзины должна быть не менее 500 рублей

Отправка оплаченного товара в курьерскую службу осуществляется в течение 1-2 рабочих дней после получения 
<b>полной</b> или <b>частичной предоплаты</b>. Для заказов на товары до 2 000 р. Требуется <b>ПОЛНАЯ</b> предоплата.

<b>Срок доставки товара от 03 до 10 рабочих дней (в зависимости от Вашего региона)</b>"""


po_pochte_text = """Информация по поводу отправления по почте весьма объемна и не помещается в сообщение telegram, 
пожалуйста, ознакомьтесь с ней по ссылке: <i>https://www.centrmag.ru/information_pages/dostavka.php/#post</i>"""


payment_methods_text = """Для ознакомления со способами оплаты вы можете перейти по ссылке: 
https://www.centrmag.ru/information_pages/oplata/ или нажать на интересующий способ из списка ниже"""
payment_methods_list = ["Оплата наличными при получении", "Оплата по безналичному расчёту", "Перевод на банковскую "
                                                                                            "карту", "Перевод на "
                                                                                                     "электронный "
                                                                                                     "кошелек",
                        "Системы денежных переводов", "Оплата с помощью платежных терминалов по всей России"]


cash_payment_text = """
<b>Оплата наличными при получении</b>

◾️  Товар можно оплатить наличными при получении в офисе 
◾  Курьеру при доставке по Москве или Подмосковью. Все необходимые финансовые документы курьер передаст вместе с заказом.
 
Документы, выдаваемые при покупке за наличный расчет: товарный и кассовый чеки без НДС в соответствии с требованиями 
<a href="https://www.centrmag.ru/catalog/product/federalnyy_zakon_o_primenenii_kontrolnokassovoy_tehni/"> 
Федерального Закона №54 «О применении контрольно-кассовой техники при осуществлении наличных денежных расчетов и (
или) расчетов с использованием электронных средств платежа»</a>."""

cashless_payment_text = """
<b>Оплата по безналичному расчёту</b>

Для юридических лиц оплата по безналичному расчёту с НДС, с предоставлением всех 
необходимых документов в соответствии с законодательством Российской Федерации."""


transfer_to_bank_card_text = """
<b>Перевод на банковскую карту</b>

◾   На карту «Сбербанка»
◾   На карту Тинькофф"""


transfer_to_e_wallet_text = """
<b>Перевод на электронный кошелек</b>

◾   Ю.Money (Яндекс.Деньги)
◾   QIWI
"""


money_transfer_systems_text = """
<b>Системы денежных переводов</b>

◾   «Золотая Корона»
◾   Western Union
"""


payment_terminal_text = """
<b>Оплата с помощью платежных терминалов по всей России</b>

В большинстве магазинов есть платежные терминалы. Их используют для пополнения счетов банковских карт, 
приема платежей за коммунальные услуги, услуги мобильной связи.

В меню терминала необходимо найти логотип одной из платежных систем (Яндекс.Деньги или QIWI). Затем произвести 
перевод через одну из систем на сумму заказа."""


how_to_track_order = """
Чтобы узнать, где находится ваша посылка или письмо, введите трек-номер на сайте Почты России www.pochta.ru/tracking

Также Вы можете воспользоваться мобильным приложением www.pochta.ru/support/post-rules/sms-notification 
и будете получать уведомления о передвижении Ваших посылок.

Если по Вашему трек-номеру нет информации, возможно, прошло еще слишком мало времени с момента отправки, 
и информация скоро появится после ее обновления на сайте почты России. Попробуйте повторить попытку позже.
"""